digraph "G" {
	a [Weight=2];
	b [Weight=3];
	b->a [Weight=1];
	c [Weight=3];
	c->a [Weight=10];
	d [Weight=2];
	d->a [Weight=1];
	e [Weight=2];
	e->a [Weight=4];
}
